Revit 2024 API
ImageInstance.IsValidView Method
 Check that the view is a valid view for ImageInstance elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public static bool IsValidView(
	View view
)
Visual Basic
Public Shared Function IsValidView ( _
	view As View _
) As Boolean
Visual C++
public:
static bool IsValidView(
	View^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view to validate
Return Value
 True if the view can contain ImageInstance elements. False otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ImageInstance Class
Autodesk.Revit.DB Namespace